package bills;

public class Runner {

  // наша программа должна:
  // описывать класс Bill (Счёт) с указанием названия услуги и суммы оплаты
  // уметь сортировать счета по названиям услуг, а потом по сумме
  // уметь сортировать счета по сумме, а потом по названиям услуг

  // "а потом" - это если на предыдущем уровне сравнения всё одинаковое
  // по названиям услуг, а потом по сумме:
  // - по названиям,
  // - если названия совпали, то по сумме.

  // - Прочитать список счетов с клавиатуры:
  //   Сначала количество, а потом для каждого счёта услугу и сумму;
  // - Вывести список, отсортированный разными способами.
  public static void main(String[] args) {

  }
}
