public class Comparisons {
    public static void main(String[] args) {
        // Каждое условие -- каждый оператор сравнения -- вернёт значение типа boolean
        System.out.println("3 > 5 = " + (3 > 5)); // 3 больше 5 -- это ложь, результат сравнения -- false
        System.out.println("3 < 7 = " + (3 < 7)); // 3 меньше 7 -- это правда, результат сравнения -- true

        // Операторы сравнения:

        // < Меньше
        // a < 10

        // > Больше
        // b > a

        // <= Меньше или равно
        // a <= 10

        // >= Больше или равно
        // speed >= max

        // == Равно
        // age == 18

        // != Не равно
        // time != 0

        // Число x чётное = число делится на 2 = число делится на 2 без остатка
        // = остаток от деления числа на 2 равен 0
        // x % 2 == 0
    }
}
