package homework_48;

public class Main {

  // Создать класс `Rectangle` (прямоугольник), которому в конструкторе нужно передавать
  // длину и ширину.
  //
  // Написать компаратор, который сравнивает прямоугольники по площади.
  //
  // Написать тесты для этого компаратора.
  public static void main(String[] args) {
    System.out.println("Hello world!");
  }
}
