public class Main {

  // ООП - объектно-ориентированное программирование
  // OOP - Object-Oriented Programming
  // парадигма программирования - общий набор идей о том, как структурировать программу и
  // организовать взаимодействие между её компонентами
  // ООП поддерживается / используется как основная, а чаще всего как единственная парадигма
  // большинством языков программирования, включая Java, JavaScript, C#, C++, Python

  // вся программа состоит из классов (class), эти классы взаимодействуют друг с другом
  // у каждого класса есть:
  // - методы (действия этого класса / над этим классом)
  // - атрибуты (свойства класса в целом или отдельного объекта)
  // ОБЫЧНО каждый класс описан в отдельном файле
  // свойства объекта - атрибуты класса

  // конструкторы
  // геттеры
  // сеттеры
  // инкапсуляция
  // static

  // GitHub
  // добавление файлов онлайн (лицензия) к существующему проекту
  public static void main(String[] args) {
    System.out.println("Hello world!");
  }
}
