import java.util.List;

public class Project1 {
  // Тема: Конвертер валют
  // получить исходную валюту, конечную валюту и сумму в исходной валюте
  // выдать сумму в конечной валюте

  // 1. Определяете общую идею
  // 2. Определяете общую структуру программы - в том числе методы
  // 3. Распределяете, кто какой метод пишет
  // 4. Пишете методы
  // 5. Совмещаете результаты работы

  // Выбираете человека, который хранит у себя результаты работы
  // Именно ему присылаете готовые части и вместе с ним объединяете методы
}
