// Нам нужен класс "Учётная запись"
// с именем и электронной почтой, которые задаются при создании.
// Менять их нельзя, но несколько человек могут регистрироваться с одной почтой

// И у каждой учётной записи есть "репутация" - целое число

// Когда мы сравниваем учётные записи, мы должны сравнить имя и почту
// На баланс мы при сравнении не обращаем внимание

// В нашей программе нужно прочитать два списка пользователей.
// Оба списка будут выглядеть одинаково:
// сначала количество записей
// потом в каждой строке по одной записи - имя (может быть с пробелами), пробел и
// электронная почта (без пробелов)

// Мы должны объединить эти два списка в множество и вывести общее количество
// уникальных пользователей в этих двух списках, а затем и самих людей.
// Первый список при этом в приоритете - именно из него мы берём баланс
// в случае разницы.
public class Person {


}
