public class Main {

  // Тесты с подстановкой ввода и проверкой вывода:
  // Лучше всего делать метод, который результат ввода получает как аргумент,
  // а данные для вывода просто возвращает.
  // Такой метод проверять намного легче.

  // Задачка: написать кассовый аппарат.
  // Он должен уметь:
  // - открывать (начинать) чек
  // - добавлять товары (не из базы, а напрямую)
  // - закрывать чек и выводить общий итог
  // - выводить общий отчёт по чекам (с общей суммой):
  //   - сортировать чеки по количеству товаров
  //   - сортировать чеки по сумме чека
}
