package homework_49;

public class Main {

  // Создайте класс `Person`, которому при создании передавайте имя и дату рождения в виде строки
  // в формате "ДД.ММ.ГГГГ".
  //
  // Реализуйте в классе интерфейс `Comparable<Person>`, в котором "меньше" будет значить "младше".
  //
  // Подсказка: не обязательно вычислять возраст, этому мы так и не научились. Но можно сравнивать
  // даты рождения!
  //
  // Альтернативная подсказка: если очень хочется вычислять возраст, то можно это делать в
  // миллисекундах с использованием `getTime()`!
  public static void main(String[] args) {
    System.out.println("Hello world!");
  }
}
