public class Main {

  public static void main(String[] args) {
    // Временная сложность операций:
    // - доступ к элементу по индексу
    // - поиск элемента / ключа
    // - вставка элемента
    // - удаление элемента

    // Коллекции
    // 1. raw array - массив[]
    // * все элементы расположены в памяти подряд
    // * размер не меняется
    // - доступ к элементу по индексу - O(1) - сдвиг в памяти
    // - поиск элемента / ключа - O(n) - линейный поиск
    // - вставка элемента - n/a (not applicable - не применимо)
    // - удаление элемента - n/a
  }
}
