public class Main {

  // Используйте класс `Student` из урока 60.
  //
  // Создайте список учеников с баллами.
  //
  // Попросите пользователя ввести минимальный проходной балл.
  //
  // Выведите список учеников согласно следующим условиям:
  // - каждый ученик выведен в отдельной строке
  // - сумма баллов каждого ученика выше минимального проходного
  // - ученики отсортированы по убыванию среднего балла
  // - в списке не больше 10 учеников (извините, конкурс)
  //
  // Для обработки и вывода результата используйте потоки (`Stream`).
  public static void main(String[] args) {
    System.out.println("Hello world!");
  }
}
