public class Main {

  // - геттеры и сеттеры
  // - файл Main
  // - взаимоотношения классов
  // - циклы

  // Задача:
  // программа, в которой можно будет прочитать, отредактировать и вывести на экран
  // или сохранить в файл базу данных с товарами.
  // Для каждого товара необходимо знать следующие вещи:
  // артикул - уникальная строка
  // название - строка
  // стоимость - специальный класс Деньги

  // Схема решения задачи:
  //
  public static void main(String[] args) {
    System.out.println("Hello world!");
  }
}
