public class Main {

  // - геттеры и сеттеры
  // - файл Main
  // - взаимоотношения классов
  // - циклы

  // Задача:
  // программа, в которой можно будет прочитать, отредактировать и вывести на экран
  // или сохранить в файл базу данных с товарами.
  // Для каждого товара необходимо знать следующие вещи:
  // артикул - уникальная строка
  // название - строка
  // стоимость - специальный класс Деньги

  // Схема решения задачи:
  // 1. Определяем, какие классы нам необходимы
  //    - класс Item для товара
  //    - класс Money для денежных сумм
  // 1.1. Определяем поля каждого класса
  // 1.2. Определяем необходимые методы
  // 2. Определить схему использования этих методов в Main
  // - либо сразу пишем методы
  // - либо сначала пишем программу в целом, используя только заготовки методов
  public static void main(String[] args) {
    System.out.println("Hello world!");
  }
}
