public class Main {

  // Игра в крестики-нолики
  // игра начинается:
  // - выводится пустое поле
  // - спрашиваются координаты крестика
  // - выводится поле с поставленным символом
  // - спрашиваются координаты нолика
  // - выводится поле с поставленным символом
  // ...
  // завершена ли игра? (проверяем состояние поля)
  //   - если да, то выводим результат
  //   - если нет, то продолжаем
  // если игра завершена, можем спросить, начать ли новую игру
  public static void main(String[] args) {
    System.out.println("=== Крестики-нолики ===");
    // TODO
    System.out.println("До свидания!");
  }
}
