public class TicTacToe { // Крестики-нолики

  // Запуск и в конце получение результата
  // игра начинается:
  // - выводится пустое поле
  // - спрашиваются координаты крестика
  // - выводится поле с поставленным крестиком
  // - спрашиваются координаты нолика
  // - выводится поле с поставленным ноликом
  // ...
  // завершена ли игра? (проверяем состояние поля)
  //   - если да, то выводим результат
  //   - если нет, то продолжаем
  public String run() {
    // TODO
    return "Результат игры";
  }
}
